{
    "posts": [
        {
            "heading": "Our Philosphy",
            "points": [
                {
                    "point": "Fostering character building, nurturing scientific temperament and strengthening social bonds are our constant endeavors. It includes all the academic work, the revisions, homework, additional preparation etc. as well as the cultural aspect so as to ensure a balanced development of the personality of the child. We guide children to help them adjust to a tough, changing world, socially and emotionally. We help our students to master the expanding horizons of technology and also become the representatives of Punjabi ethos and culture."
                }
            ]
        },
        {
            "heading": "History",
            "points": [
                {
                    "point": "G.A.D first opened its doors in September 2010. Initially, a couple of classrooms at 7475 135th Street, Surrey were leased to teach a total of 16 students from Kindergarten to Grade 3. At that time, the vision and purpose of the school were established by a group of committed parents who wanted to raise their children with Sikh values while also maintaining a smooth transition to the mainstream multicultural community.There were many hurdles in the early stages. Facilities, staffing, equipment and parent support were all integral to G.A.D. becoming firmly rooted. Although meagre in the early years, those families stood by us through the tough challenges of establishing this school. They had strong convictions and believed in the growth and development of the school. In 2011 – 2012, the school leased more units in the same building. The school grew and developed during that period. A pre-school was added to the facility. The following year 2012 – 2013 more units were leased and the enrollment reached a peak of 200 students from Kindergarten to Grade 6. The overwhelming response of the parents and the growing popularity of the school enthused the Board of PALS Society to look for a bigger campus. Fortunately, they found the present location, 13479 77th Avenue, Surrey to be an ideal place for the school. They envisioned remodelling with spacious classrooms, a huge gym, open playfield, a large parking area, and the possibility of expansion in the future. In September 2013, PALS Society of Canada after seeking Waheguru Ji’s blessing opened the doors of its new facility where they could grow the school to support the expanding student body. The school is committed to providing new educational programs and learning experiences for the students to help them become responsible and contributing members of society."
                }
            ]
        },
        {
            "heading": "Mission",
            "points": [
                {
                    "point": "To ensure that children attending school will experience a learning environment that enables every child to feel safe, accepted and respected."
                },
                {
                    "point": "To empower the children with a solid foundation of knowledge and life skills to achieve the goals of today and face the challenges of tomorrow."
                },
                {
                    "point": "To ignite students’ rational thinking, clear vision, positive mindset, and integrated personality."
                },
                {
                    "point": "To inculcate self-esteem and a sense of responsibility in our students; sensitizing their minds toward the need of others."
                },
                {
                    "point": "To make students, teacher, and parents partners in education for life."
                }
            ]
        },
        {
            "heading": "Vision",
            "points": [
                {
                    "point": "Opportunities and an environment to be lifelong learners."
                },
                {
                    "point": "Tools to promote critical thinking and problem-solving skills."
                },
                {
                    "point": "Skills needed to be productive and responsible citizens."
                },
                {
                    "point": "Values such as tolerance, truth, respect, and compassion."
                },
                {
                    "point": "An appreciation of our culture, heritage, and arts."
                },
                {
                    "point": "Ensure progressive holistic education."
                },
                {
                    "point": "Challenging opportunities in a widening varieties of disciplines."
                },
                {
                    "point": "Make education an exciting experience."
                },
                {
                    "point": "Organize a human development program for teachers, parents, and students."
                }
            ]
        }
    ]
}